[
  {
    "title": "Full Stack Developer",
    "company": "ACMO Technology & Solutions Pvt Ltd",
    "location": "Tamil Nadu, India",
    "period": "September 2025 - Present",
    "description": "As a Full Stack Developer at ACMO, I am contributing to the design and development of scalable web applications. My responsibilities include building intuitive frontends with React and Next.js, developing efficient backends with Node.js, and working with databases like MongoDB. I collaborate with cross-functional teams to deliver high-quality solutions, implement new features, and ensure applications meet performance and security standards.",
    "achievements": [""]
  },
  {
    "title": "Full Stack Developer",
    "company": "Plenitude IT Pvt Ltd",
    "location": "Tamil Nadu, India",
    "period": "July 2022 - August 2025",
    "description": "Worked as a Full Stack Developer, building and maintaining web applications using modern technologies like React, Next.js, Node.js, and MongoDB. Responsible for developing both frontend and backend components, implementing new features, and ensuring optimal performance.",
    "achievements": [
      "Developed and maintained multiple client projects with high satisfaction rates",
      "Optimized application performance resulting in 40% faster load times",
      "Delived projects within deadlines, ensuring timely releases",
      "Collaborated with cross-functional teams to define, design, and ship new features",
      "Implemented best practices in code quality and testing, reducing bugs by 30%"
    ]
  },
  {
    "title": "Freelancer",
    "company": "Self-employed",
    "location": "Remote",
    "period": "July 2021 - July 2022",
    "description": "Worked on 2+ projects, developing websites and web applications for own usage. Managed the entire development lifecycle from requirement gathering to deployment and maintenance.",
    "achievements": [
      "Successfully delivered 2+ projects for own skill development and usage",
      "Built responsive and accessible web applications",
      "Implemented SEO best practices resulting in improved search rankings"
    ]
  }
]
